app/controllers/gossip_controller.rb

  def show
    @show_gossip = Gossipp.find(params[:id_gossip])
---
SELECT "gossipps".* FROM "gossipps" WHERE "gossipps"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]