app/controllers/gossips_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
INSERT INTO "gossipps" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "zsazsazs"], ["content", "zszsazsazs"], ["created_at", "2019-08-09 08:14:03.519509"], ["updated_at", "2019-08-09 08:14:03.519509"], ["user_id", 58]]
---
  def create
    @user = User.find(58)
    @gossips = Gossipp.new(title:params[:title], content:params[:content], user_id: @user.id)

    if @gossips.save

SELECT "gossipps".* FROM "gossipps" WHERE "gossipps"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
---
  def edit

  @gossips = Gossipp.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
SELECT "gossipps".* FROM "gossipps" WHERE "gossipps"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
UPDATE "gossipps" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossipps"."id" = $4  [["title", "zhjshzjhsj"], ["content", "sxzexzxzdxxd"], ["updated_at", "2019-08-09 08:18:41.849783"], ["id", 84]]
---
  def update
  @user = User.find(58)
  @gossips = Gossipp.find(params[:id])
  @gossips.update(title: params[:title], content: params[:content])

SELECT "gossipps".* FROM "gossipps" WHERE "gossipps"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
DELETE FROM "gossipps" WHERE "gossipps"."id" = $1  [["id", 84]]
---
  def destroy
    @gossips = Gossipp.find(params[:id])
    @gossips.destroy