app/controllers/home_controller.rb

SELECT "gossipps".* FROM "gossipps"
---
  def index
    @user = params[:user]
    @gossip = Gossipp.all